index.org
#+TITLE: https://ENGR110.github.io
#+OPTIONS: toc:nil date:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="assignments/org.css"/>

Welcome to E110!  "Engineering Computing Architecture" is about how computers are built from simpler components, and how they encode information into physical parts.  Along the way, we will also cover the Linux shell, Hardware Description Languages (HDL) and intermediate Python programming.


* Prerequisites
  Students should have already taken ENGR-E 101 Innovation and Design: https://registrar.indiana.edu/browser/soc4192/ENGR/ENGR-E101.shtml

  Students should also come to E110 prepared with:
  - intermediate computer literacy
  - editing, saving, and sharing documents
  - working knowledge of Windows, MacOS, and/or Linux
  - beginner experience in Python programming language (variables, functions, loops, lists)
  - beginner experience with electronics (knowledge of transistors, microcontrollers, voltage, electricity)

* Outcomes
  Students will finish E110 with knowledge in:
  - fundamentals of digital logic (gates from transistors, complex gates from simple gates)
  - how a CPU is constructed, as a system, from simpler components
  - number representations (decimal, hexadecimal, binary)
  - Linux command-line interface (CLI)
  - MyHDL (hardware description language in the form of a Python library)
  - intermediate Python

* Contact

  | name            | role       | office      | email           | office hours             |
  |-----------------+------------+-------------+-----------------+--------------------------|
  | Alex Shroyer    | instructor | Luddy 4148  | ashroyer@iu.edu | (Tues;Thurs) 01:00-02:00 |
  | Juliette Zerick | AI         | Luddy 4114M | jzerick@iu.edu  | (Mon) 03:00-04:00        |
  | Daniel Osei     | AI         | Luddy 4125  | dosei@iu.edu    |                          |

* Classroom location, meeting times

  | section | lecture           | lab                      | location   |
  |---------|-------------------|--------------------------|------------|
  |   10678 | (Mon) 10:10-11:00 | (Tues;Thurs) 11:15-12:30 | Luddy 4111 |
  |   29714 | (Mon) 11:15-12:05 | (Tues;Thurs) 04:00-05:15 | Luddy 4111 |

* Announcements
  We will post to Canvas with updates/clarifications/announcements.  By default, you should already have notifications from Canvas enabled.  It is your responsibility to ensure you can receive such announcements.

* Autograder
  We will an automated grading system for assignments: [[https://autograder.sice.indiana.edu][autograder link]]

  For security reasons, you must access it through the IU network - either access it while on campus, or use a [[https://kb.iu.edu/d/ajrq][VPN]] service to make the site think you're on campus.

* Materials/Textbooks
  - Textbook: /The Elements of Computing Systems/ by Noam Nisan and Shimon Schocken. ISBN 978-0262640688

    (This course covers chapters 1-6 of the [[https://www.nand2tetris.org/course][Nand to Tetris course]])
  - Python: Use the [[https://docs.python.org/3/index.html][docs for Python version 3.7.2 (latest stable release)]]
  - MyHDL: [[http://docs.myhdl.org/en/stable/][Manual]] and [[http://www.myhdl.org/docs/examples/][Examples]]

* Conduct
  **Lab/Classroom etiquette**

  1. Respect others who want to work or listen quietly, minimize distractions.
  2. No food or open drinks.  Non-spill bottles are OK.
  3. Leave the lab at least as clean as you found it.
  4. Log out before leaving.

  **Do your own work**

  Collaboration for learning and helping each other is encouraged, however all assignments must be exclusively _your own work_.  Cheating results in 0 credit for the assignment, reporting to the Dean, and possible further consequences.  Cheating also includes allowing others to copy your work.

  See the [[http://studentcode.iu.edu/responsibilities/academic-misconduct.html][official IU policy]] for more information.

  **No late work**

  You may submit multiple times to the Autograder; the highest scoring submission is the one that will be used in grading. No submissions after the deadline will be accepted. Sometimes the Autograder server may be heavily used and respond more slowly, so plan accordingly.

  Extensions may, at the instructor's discretion, be given to individuals in extreme circumstances, such as medical emergencies (Doctor note required).

  **Attendance**

  We will take attendance at random times throughout the semester, primarily for enrollment reporting purposes.

* Get the help you need
  **Disability Assistance**

  If you require accommodations for a disability, please let your instructor know within the first 3 weeks of the semester.  As soon as we are aware of your needs, we can work with the Office of Disability Services for Students ([[https://studentaffairs.indiana.edu/disability-services-students/index.shtml][DSS]]) to help determine appropriate academic accommodations.  Any information you share with us will be treated as confidential.

  **Tutoring**

  SICE tutoring is available free of charge for this course (and others you may be taking currently, such as ENGR-E111).  Sunday 2-6pm, Monday-Thursday 6-9pm, at Teter F160.

