index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-15 Mon 11:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ENGR-E110</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="assignments/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ENGR-E110</h1>
<p>
<a href="https://engr110.github.io">https://engr110.github.io</a>
</p>

<p>
Welcome to E110!  "Engineering Computing Architecture" is about how computers are built from simpler components, and how they encode information into physical parts.  Along the way, we will also cover the Linux shell, Hardware Description Languages (HDL) and intermediate Python programming.
</p>


<div id="outline-container-org1a180c3" class="outline-2">
<h2 id="org1a180c3">Prerequisites</h2>
<div class="outline-text-2" id="text-org1a180c3">
<p>
Students should have already taken ENGR-E 101 Innovation and Design: <a href="https://registrar.indiana.edu/browser/soc4192/ENGR/ENGR-E101.shtml">https://registrar.indiana.edu/browser/soc4192/ENGR/ENGR-E101.shtml</a>
</p>

<p>
Students should also come to E110 prepared with:
</p>
<ul class="org-ul">
<li>intermediate computer literacy</li>
<li>editing, saving, and sharing documents</li>
<li>working knowledge of Windows, MacOS, and/or Linux</li>
<li>beginner experience in Python programming language (variables, functions, loops, lists)</li>
<li>beginner experience with electronics (knowledge of transistors, microcontrollers, voltage, electricity)</li>
</ul>
</div>
</div>

<div id="outline-container-orga1ea9ae" class="outline-2">
<h2 id="orga1ea9ae">Outcomes</h2>
<div class="outline-text-2" id="text-orga1ea9ae">
<p>
Students will finish E110 with knowledge in:
</p>
<ul class="org-ul">
<li>fundamentals of digital logic (gates from transistors, complex gates from simple gates)</li>
<li>how a CPU is constructed, as a system, from simpler components</li>
<li>number representations (decimal, hexadecimal, binary)</li>
<li>Linux command-line interface (CLI)</li>
<li>MyHDL (hardware description language in the form of a Python library)</li>
<li>intermediate Python</li>
</ul>
</div>
</div>

<div id="outline-container-org34c3b4f" class="outline-2">
<h2 id="org34c3b4f">Contact</h2>
<div class="outline-text-2" id="text-org34c3b4f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">name</th>
<th scope="col" class="org-left">role</th>
<th scope="col" class="org-left">office</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">office hours</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Alex Shroyer</td>
<td class="org-left">instructor</td>
<td class="org-left">Luddy 4148</td>
<td class="org-left">ashroyer@iu.edu</td>
<td class="org-left">(Tues;Thurs) 01:00-02:00</td>
</tr>

<tr>
<td class="org-left">Juliette Zerick</td>
<td class="org-left">AI</td>
<td class="org-left">Luddy 4114M</td>
<td class="org-left">jzerick@iu.edu</td>
<td class="org-left">(Mon) 03:00-04:00</td>
</tr>

<tr>
<td class="org-left">Daniel Osei</td>
<td class="org-left">AI</td>
<td class="org-left">Luddy 4125</td>
<td class="org-left">dosei@iu.edu</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5331681" class="outline-2">
<h2 id="org5331681">Classroom location, meeting times</h2>
<div class="outline-text-2" id="text-org5331681">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">section</th>
<th scope="col" class="org-left">lecture</th>
<th scope="col" class="org-left">lab</th>
<th scope="col" class="org-left">location</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">10678</td>
<td class="org-left">(Mon) 10:10-11:00</td>
<td class="org-left">(Tues;Thurs) 11:15-12:30</td>
<td class="org-left">Luddy 4111</td>
</tr>

<tr>
<td class="org-right">29714</td>
<td class="org-left">(Mon) 11:15-12:05</td>
<td class="org-left">(Tues;Thurs) 04:00-05:15</td>
<td class="org-left">Luddy 4111</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org03ef421" class="outline-2">
<h2 id="org03ef421">Announcements</h2>
<div class="outline-text-2" id="text-org03ef421">
<p>
We will post to Canvas with updates/clarifications/announcements.  By default, you should already have notifications from Canvas enabled.  It is your responsibility to ensure you can receive such announcements.
</p>
</div>
</div>

<div id="outline-container-org4f2c3c8" class="outline-2">
<h2 id="org4f2c3c8">Autograder</h2>
<div class="outline-text-2" id="text-org4f2c3c8">
<p>
We will an automated grading system for assignments: <a href="https://autograder.sice.indiana.edu">autograder link</a>
</p>

<p>
For security reasons, you must access it through the IU network - either access it while on campus, or use a <a href="https://kb.iu.edu/d/ajrq">VPN</a> service to make the site think you're on campus.
</p>
</div>
</div>

<div id="outline-container-org64c0e61" class="outline-2">
<h2 id="org64c0e61">Materials/Textbooks</h2>
<div class="outline-text-2" id="text-org64c0e61">
<ul class="org-ul">
<li><p>
Textbook: <i>The Elements of Computing Systems</i> by Noam Nisan and Shimon Schocken. ISBN 978-0262640688
</p>

<p>
(This course covers chapters 1-6 of the <a href="https://www.nand2tetris.org/course">Nand to Tetris course</a>)
</p></li>
<li>Python: Use the <a href="https://docs.python.org/3/index.html">docs for Python version 3.7.2 (latest stable release)</a></li>
<li>MyHDL: <a href="http://docs.myhdl.org/en/stable/">Manual</a> and <a href="http://www.myhdl.org/docs/examples/">Examples</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19f07d2" class="outline-2">
<h2 id="org19f07d2">Conduct</h2>
<div class="outline-text-2" id="text-org19f07d2">
<p>
<b><b>Lab/Classroom etiquette</b></b>
</p>

<ol class="org-ol">
<li>Respect others who want to work or listen quietly, minimize distractions.</li>
<li>No food or open drinks.  Non-spill bottles are OK.</li>
<li>Leave the lab at least as clean as you found it.</li>
<li>Log out before leaving.</li>
</ol>

<p>
<b><b>Do your own work</b></b>
</p>

<p>
Collaboration for learning and helping each other is encouraged, however all assignments must be exclusively <span class="underline">your own work</span>.  Cheating results in 0 credit for the assignment, reporting to the Dean, and possible further consequences.  Cheating also includes allowing others to copy your work.
</p>

<p>
See the <a href="http://studentcode.iu.edu/responsibilities/academic-misconduct.html">official IU policy</a> for more information.
</p>

<p>
<b><b>No late work</b></b>
</p>

<p>
You may submit multiple times to the Autograder; the highest scoring submission is the one that will be used in grading. No submissions after the deadline will be accepted. Sometimes the Autograder server may be heavily used and respond more slowly, so plan accordingly.
</p>

<p>
Extensions may, at the instructor's discretion, be given to individuals in extreme circumstances, such as medical emergencies (Doctor note required).
</p>

<p>
<b><b>Attendance</b></b>
</p>

<p>
We will take attendance at random times throughout the semester, primarily for enrollment reporting purposes.
</p>
</div>
</div>

<div id="outline-container-orgd015768" class="outline-2">
<h2 id="orgd015768">Get the help you need</h2>
<div class="outline-text-2" id="text-orgd015768">
<p>
<b><b>Disability Assistance</b></b>
</p>

<p>
If you require accommodations for a disability, please let your instructor know within the first 3 weeks of the semester.  As soon as we are aware of your needs, we can work with the Office of Disability Services for Students (<a href="https://studentaffairs.indiana.edu/disability-services-students/index.shtml">DSS</a>) to help determine appropriate academic accommodations.  Any information you share with us will be treated as confidential.
</p>

<p>
<b><b>Tutoring</b></b>
</p>

<p>
SICE tutoring is available free of charge for this course (and others you may be taking currently, such as ENGR-E111).  Sunday 2-6pm, Monday-Thursday 6-9pm, at Teter F160.
</p>
</div>
</div>
