index.html

<div id="outline-container-org2bf2536" class="outline-2">
<h2 id="org2bf2536">Schedule</h2>
<div class="outline-text-2" id="text-org2bf2536">
<p>
See also: <a href="https://registrar.indiana.edu/official-calendar/official-calendar-spring.shtml?s=16w">Official IU Calendar for Spring 2019</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Day</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Reading</th>
<th scope="col" class="org-left">Assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">01/07</td>
<td class="org-left">Mon</td>
<td class="org-left">Intro, Linux CLI</td>
<td class="org-left"><a href="https://beebom.com/essential-linux-commands/">Essential Linux Commands</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/08</td>
<td class="org-left">Tues</td>
<td class="org-left">Python CLI, number conversion</td>
<td class="org-left"><a href="https://docs.python.org/3/library/functions.html#int">Python builtin functions</a></td>
<td class="org-left"><a href="./assignments/A00a.html">A00a</a></td>
</tr>

<tr>
<td class="org-left">01/10</td>
<td class="org-left">Thurs</td>
<td class="org-left">Autograder practice</td>
<td class="org-left">MyHDL manual <a href="http://docs.myhdl.org/en/stable/manual/preface.html">M1</a>, <a href="http://docs.myhdl.org/en/stable/manual/background.html">M2</a>, <a href="http://docs.myhdl.org/en/stable/manual/intro.html">M3</a></td>
<td class="org-left"><a href="./assignments/A00b.html">A00b</a></td>
</tr>

<tr>
<td class="org-left">01/14</td>
<td class="org-left">Mon</td>
<td class="org-left">MyHDL, Boolean Logic</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_f2c9e41f0b204a34ab78be0ae4953128.pdf">Ch1</a> and <a href="https://drive.google.com/file/d/1MY1buFHo_Wx5DPrKhCNSA2cm5ltwFJzM/view">slides1</a></td>
<td class="org-left"><a href="./assignments/A01.html">A01</a></td>
</tr>

<tr>
<td class="org-left">01/15</td>
<td class="org-left">Tues</td>
<td class="org-left">truth tables</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/17</td>
<td class="org-left">Thurs</td>
<td class="org-left">truth tables, continued</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/21</td>
<td class="org-left">Mon</td>
<td class="org-left">MLK Jr. Day</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/22</td>
<td class="org-left">Tues</td>
<td class="org-left">Gates: 16-input and/or/etc.</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_f0eaab042ba042dcb58f3e08b46bb4d7.pdf">Ch2</a> and <a href="https://docs.wixstatic.com/ugd/56440f_2e6113c60ec34ed0bc2035c9d1313066.pdf">slides2</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/24</td>
<td class="org-left">Thurs</td>
<td class="org-left">Gates: Mux, Demux</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/28</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/29</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">01/31</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/04</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://docs.myhdl.org/en/stable/manual/hwtypes.html">hwtypes</a> and <a href="http://docs.myhdl.org/en/stable/manual/structure.html">structure</a></td>
<td class="org-left"><a href="./assignments/A02.html">A02</a></td>
</tr>

<tr>
<td class="org-left">02/05</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/07</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/11</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_862828b3a3464a809cda6f44d9ad2ec9.pdf">Ch3</a> and <a href="https://docs.wixstatic.com/ugd/56440f_3b9f5721e3e149fba8687847da395c43.pdf">slides3</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/12</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://docs.myhdl.org/en/stable/manual/rtl.html#sequential-logic">M4</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/14</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/18</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/19</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/21</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/25</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_7ef1c00a714c46768f08c459a6cab45a.pdf">Ch4</a> and <a href="https://docs.wixstatic.com/ugd/56440f_12f488fe481344328506857e6a799f79.pdf">slides4</a></td>
<td class="org-left"><a href="./assignments/A03.html">A03</a> (due Wed)</td>
</tr>

<tr>
<td class="org-left">02/26</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">02/28</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/04</td>
<td class="org-left">Mon</td>
<td class="org-left"><a href="./assignments/MidtermReview.html">Midterm Review</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/05</td>
<td class="org-left">Tues</td>
<td class="org-left"><a href="./assignments/MidtermReview.html">Midterm Review</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/07</td>
<td class="org-left">Thurs</td>
<td class="org-left">Midterm - normal class time</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/11</td>
<td class="org-left">Mon</td>
<td class="org-left">Spring Break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/12</td>
<td class="org-left">Tues</td>
<td class="org-left">Spring Break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/14</td>
<td class="org-left">Thurs</td>
<td class="org-left">Spring Break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/18</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_b2cad2eea33847869b86c541683551a7.pdf">Ch5</a> and <a href="https://docs.wixstatic.com/ugd/56440f_96cbb9c6b8b84760a04c369453b62908.pdf">slides5</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/19</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="./assignments/A04.html">A04</a></td>
</tr>

<tr>
<td class="org-left">03/21</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/25</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">03/26</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="./assignments/A05.html">A05</a></td>
</tr>

<tr>
<td class="org-left">03/28</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/01</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://docs.wixstatic.com/ugd/44046b_89a8e226476741a3b7c5204575b8a0b2.pdf">Ch6</a> and <a href="https://docs.wixstatic.com/ugd/56440f_65a2d8eef0ed4e0ea2471030206269b5.pdf">slides6</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/02</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/04</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/08</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/09</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="./assignments/A06.html">A06</a></td>
</tr>

<tr>
<td class="org-left">04/11</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/15</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="./assignments/A07.html">A07</a></td>
</tr>

<tr>
<td class="org-left">04/16</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/18</td>
<td class="org-left">Thurs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/22</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/23</td>
<td class="org-left">Tues</td>
<td class="org-left">Final Review</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">04/25</td>
<td class="org-left">Thurs</td>
<td class="org-left">Final Exam - normal class time</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
</tr>

<tr>
<td class="org-left">04/29</td>
<td class="org-left">Mon</td>
<td class="org-left">Finals Week</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">04/30</td>
<td class="org-left">Tues</td>
<td class="org-left">Finals Week</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">05/02</td>
<td class="org-left">Thurs</td>
<td class="org-left">Finals Week</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">05/06</td>
<td class="org-left">Mon</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">05/07</td>
<td class="org-left">Tues</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">05/09</td>
<td class="org-left">Thurs</td>
<td class="org-left">Semester Ends</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
